# Дана строка. Преобразовать в ней все прописные латинские буквы в строчные.
s = input('Строка: ')  # Ввод данных
print(s.lower())  # Вывод результата
